[
  {
    "AP_Office": "WASHINGTON",
    "Brief": "WASHINGTON (AP) - Accusing her of betrayal and insubordination, President Donald Trump on Monday fired Sally Yates, the acting attorney general of the United States and a Democratic appointee, after she publicly questioned the constitutionality of his controversial refugee and immigration ban and refused to defend it in court. The dramatic public clash between the new president and the nation's top law enforcement officer laid bare the growing discord and dissent surrounding Trump's executive order, which temporarily halted the entire U.S. refugee program and banned all entries from seven Muslim-majority nations for 90 days. The firing came hours after Yates directed Justice Department attorneys not to defend the executive order, saying she was not convinced it was lawful or consistent with the agency's obligation \"to stand for what is right.\" Trump soon followed with a statement accusing Yates of having \"betrayed the Department of Justice by refusing to enforce a legal order designed to protect the citizens of the United States.\" He immediately named longtime federal prosecutor Dana Boente, the U.S.",
    "CTIME": "2017-01-30-23-12-22",
    "Full_Story": "http://hosted.ap.org//dynamic/stories/U/US_TRUMP_TRAVEL_BAN_FALLOUT?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2017-01-30-23-12-22",
    "Headline": "Trump fires Justice Dept. head over executive order defiance"
  },
  {
    "AP_Office": "QUEBEC CITY",
    "Brief": "QUEBEC CITY (AP) - A French Canadian known for far-right, nationalist views was charged Monday with six counts of first-degree murder and five counts of attempted murder over the shooting rampage at a Quebec City mosque that Canada's prime minister called an act of terrorism against Muslims. Suspect Alexandre Bissonnette made a brief court appearance and did not enter a plea in the attack that left six people dead during evening prayers Sunday. Wearing a white prisoner jump suit, his hands and feet shackled, he stared down at the floor and fidgeted, but did not speak. The 27-year-old suspect, who has espoused support for the French far-right party of Marine Le Pen and had liked U.S.",
    "CTIME": "2017-01-30-20-20-11",
    "Full_Story": "http://hosted.ap.org//dynamic/stories/C/CN_CANADA_MOSQUE_SHOOTING?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2017-01-30-20-20-11",
    "Headline": "6 counts of murder for Quebec mosque attack suspect"
  },
  {
    "AP_Office": "Your daily look at late-breaking news, upcoming events and the stories that will be talked about Tuesday. 1. MOUNTING LEGAL CHALLENGES CONFRONT TRUMP IMMIGRATION ORDER Civil liberties advocates object to the policy they say discriminates against Muslims, while the acting U.S. attorney general says the order may be illegal. 2. TRAVEL BAN THROWS THOUSANDS OF LIVES INTO LIMBO Middle Eastern students who had been studying in the U.S., and foreigners planning to visit loved ones are among those struggling to find ways in. 3. QUEBEC MOSQUE ATTACK SUSPECT FACES 6 MURDER COUNTS French Canadian Alexandre Bissonnette, who had been known for his far-right views, is accused in the rampage.",
    "Brief": "Your daily look at late-breaking news, upcoming events and the stories that will be talked about Tuesday. 1. MOUNTING LEGAL CHALLENGES CONFRONT TRUMP IMMIGRATION ORDER Civil liberties advocates object to the policy they say discriminates against Muslims, while the acting U.S. attorney general says the order may be illegal. 2. TRAVEL BAN THROWS THOUSANDS OF LIVES INTO LIMBO Middle Eastern students who had been studying in the U.S., and foreigners planning to visit loved ones are among those struggling to find ways in. 3. QUEBEC MOSQUE ATTACK SUSPECT FACES 6 MURDER COUNTS French Canadian Alexandre Bissonnette, who had been known for his far-right views, is accused in the rampage.",
    "CTIME": "2017-01-30-21-03-47",
    "Full_Story": "http://hosted.ap.org//dynamic/stories/1/10_THINGS_TO_KNOW_TUESDAY?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2017-01-30-21-03-47",
    "Headline": "10 Things to Know for Tuesday"
  },
  {
    "AP_Office": "DALLAS",
    "Brief": "DALLAS (AP) - The Boy Scouts of America announced Monday that it will allow transgender children who identify as boys to enroll in its boys only programs. The organization said it had made the decision to begin basing enrollment in its boys-only programs on the gender a child or parent lists on the application to become a scout. The Boy Scouts had previously held a policy that relied on the gender listed on a child's birth certificate for those programs. The organization's leadership had considered a recent case in Secaucus, New Jersey, where an 8-year-old transgender child had been asked to leave his Scout troop after parents and leaders found out he is transgender.",
    "CTIME": "2017-01-30-22-56-20",
    "Full_Story": "http://hosted.ap.org//dynamic/stories/U/US_TRANSGENDER_BOY_SCOUTS?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2017-01-30-22-56-20",
    "Headline": "Boy Scouts will allow transgender children into programs"
  },
  {
    "AP_Office": "SAN DIEGO",
    "Brief": "SAN DIEGO (AP) - U.S. combat veterans who served in Iraq and Afghanistan say they are outraged at the temporary ban on immigration from seven Muslim-majority countries that has blocked visas for Iraqi interpreters who risked their lives to help American troops on the battlefield. Thousands of veterans have signed petitions. One soldier says he has bought a plane ticket for his Afghan translator in case that country is added to the list of banned nations. Many veterans say they feel betrayed by the executive order signed by President Donald Trump on Friday that also suspends the admission of all refugees to the U.S.",
    "CTIME": "2017-01-30-21-13-04",
    "Full_Story": "http://hosted.ap.org//dynamic/stories/U/US_TRUMP_TRAVEL_BAN_INTERPRETERS_ASOL-?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2017-01-30-21-13-04",
    "Headline": "Veterans protest travel ban, saying it hurts interpreters"
  },
  {
    "AP_Office": "WASHINGTON",
    "Brief": "WASHINGTON (AP) - Since taking office 10 days ago, President Donald Trump has moved to consolidate power within a small cadre of close aides at the White House. He's added a senior political adviser to the National Security Council and appears to have cut out Cabinet secretaries from decision making on some of his top policies, including the immigration and refugee order that led to protests, legal challenges and temporary detention of some legal U.S. residents this weekend. Trump has empowered a small group of advisers, some of whom have no experience in government, to tackle a broad range of issues - including national security, the immigration policy, U.S.",
    "CTIME": "2017-01-30-20-01-36",
    "Full_Story": "http://hosted.ap.org//dynamic/stories/U/US_TRUMP_WHO_IS_IN_CHARGE?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2017-01-30-20-01-36",
    "Headline": "In new White House, a look at Trump's inner circle"
  },
  {
    "AP_Office": "LOS ANGELES",
    "Brief": "LOS ANGELES (AP) - From Dubai to Los Angeles, President Donald Trump's order barring travelers from seven Muslim countries from entering the U.S. has thrown the lives of thousands into limbo. Middle Eastern scholars who have been studying in the U.S., foreigners planning to visit loved ones living in this country, and others who were outside the United States when the order was issued last week are struggling to find a way in. Also, some legal U.S. residents and visitors from the affected nations are afraid to leave the U.S. for business or family reasons, fearful they won't be allowed back.",
    "CTIME": "2017-01-30-20-23-50",
    "Full_Story": "http://hosted.ap.org//dynamic/stories/U/US_TRUMP_TRAVEL_BAN_LIMBO?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2017-01-30-20-23-50",
    "Headline": "Trump ban creates chaos for travelers in, out of the country"
  },
  {
    "AP_Office": "CHICAGO",
    "Brief": "CHICAGO (AP) - Even in your 70s and beyond, simple activities including web-surfing, playing bridge and socializing can stave off mental decline, new research says. Benefits were greatest in computer users and in those without a gene variation linked with Alzheimer's disease. But even among seniors with that trait, mental decline that sometimes precedes dementia was less common among those who engaged in mind-stimulating activities. The results don't apply to costly, computer-based games that purport to keep the brain sharp - those were not studied. The benefits were found from activities that many seniors have access to. \"They don't have to spend their life savings\" on fancy gadgets, said Dr.",
    "CTIME": "2017-01-30-12-09-48",
    "Full_Story": "http://hosted.ap.org//dynamic/stories/U/US_MED_EXERCISING_OID_BRAINS_ILOL-?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2017-01-30-12-09-48",
    "Headline": "Games, crafts, other activities may safeguard aging brain"
  },
  {
    "AP_Office": "BOSTON",
    "Brief": "BOSTON (AP) - The enemies list is long in New England, and it grows with each tweet that dares to doubt Tom Brady's supremacy or call coach Bill Belichick a cheater. But there's one opponent who has escaped the fury of the Foxborough fans, and even has a considerable amount of goodwill in the heart of New England. In fact, it's hard to find any kind of animosity toward Atlanta Falcons quarterback Matt Ryan, who built his reputation - personally and professionally - at Boston College. \"It's hard to think of anything bad to say about Matt,\" said former BC sports information director Chris Cameron, who was in the athletic department when Ryan led the Eagles to a No.",
    "CTIME": "2017-01-30-15-22-28",
    "Full_Story": "http://hosted.ap.org//dynamic/stories/F/FBN_SUPER_BOWL_BOSTON_AND_RYAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2017-01-30-15-22-28",
    "Headline": "In enemy territory, nary a bad word about Falcons QB Ryan"
  },
  {
    "AP_Office": "WASHINGTON",
    "Brief": "WASHINGTON (AP) - The legal fight over President Donald Trump's ban on refugees is likely to turn on questions of a president's authority to control America's borders and on whether the new immigration policy unconstitutionally discriminates against Muslims. Civil liberties advocates have challenged the order, which temporarily suspends immigration from seven countries and the United States' broader refugee program. It has drawn nationwide protests since the order was issued on Friday. Federal judges in New York and several other states issued orders that temporarily block the government from deporting people with valid visas who arrived after Trump's travel ban took effect.",
    "CTIME": "2017-01-30-22-04-34",
    "Full_Story": "http://hosted.ap.org//dynamic/stories/U/US_TRUMP_TRAVEL_BAN_LEGAL?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2017-01-30-22-04-34",
    "Headline": "Trump's immigration order faces mounting legal questions"
  }
]